DataProcessors/гф_РабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<DataProcessor>
		<Properties>
			<Name>гф_РабочееМестоКладовщика</Name>
			<Comment>53</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>NVE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенОптовая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИнвойса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПТУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гф_НастройкиПечатиСвойствЭтикеток</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АртикулУпаковки</Name>
							<Comment>ростовка</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Comment>артикул номенклатуры</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБазЕдиниц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзмБазовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЭтикеток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NVE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКлиента</Name>
							<Comment>код партнера</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолныйКодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Убрать</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Добавить</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СераяМетка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары_УправлениеПоставкой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комплектация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NVE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЕН</Name>
							<Type>
								<v8:Type>cfg:EnumRef.гф_СтатусыИсключений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспечатанПризнак</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаспечатанДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/гф_РабочееМестоКладовщика/Forms/ФормаПодтвержденияПеремаркировки/Ext/Form/Module.bsl
// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// При удачном введении GTIN открывается ввод КМ 
// Галфинд_Домнышева 2023/07/17
&НаКлиенте
Процедура ОтсканироватьGTINПриИзменении(Элемент)
	
	Если ОтсканироватьGTIN = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Введите GTIN заново!");
		Возврат;
	КонецЕсли;	

	Элементы.ОтсканироватьGTIN.Видимость = Ложь;
	Элементы.ОтсканироватьКМ.Видимость = Истина;
	
	ТекущийЭлемент = Элементы.ОтсканироватьКМ;
	
КонецПроцедуры// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// При удачном введении КМ вызывается группа команд 
// Галфинд_Домнышева 2023/07/17
&НаКлиенте
Процедура ОтсканироватьКМПриИзменении(Элемент)
	
	Если ОтсканироватьКМ = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Введите КМ заново!");
		Возврат;
	КонецЕсли;	
	
	Результат = ОтсканироватьКМПриИзмененииНаСервере();
	
	Элементы.ОтсканироватьКМ.Видимость = Ложь;
	Элементы.ГруппаКоманд.Видимость = Истина;
		//ЭтотОбъект.ТекущийЭлемент = Элементы.ОтсканироватьКМ;
	Если НЕ Результат Тогда 
		Элементы.Завершить.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Команда повторит 
// Галфинд_Домнышева 2023/07/17
&НаКлиенте
Процедура Повторить(Команда)
	
	Элементы.ОтсканироватьGTIN.Видимость = Истина;
	Элементы.ОтсканироватьКМ.Видимость = Ложь;
    Элементы.ГруппаКоманд.Видимость = Ложь;
	
	ОтсканироватьGTIN = "";
	ОтсканироватьКМ = "";
	
	ТекущийЭлемент = Элементы.ОтсканироватьGTIN;

КонецПроцедуры// } #wortmann

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
	// Галфинд_Домнышева 2023/07/17
	ДокументОснованиеПеремаркировки = Параметры.ДокументОснованиеПеремаркировки;
	// } #wortmann
КонецПроцедуры

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Проверяется принадлежность КМ и GTIN, документу Основанию и в РС гф_КМДляПеремаркировки
// Галфинд_Домнышева 2023/07/17 
//
// Возвращаемое значение:
//	Булево - Истина в случае успешного подтверждения КМ, иначе Ложь
&НаСервере
Функция  ОтсканироватьКМПриИзмененииНаСервере()
	
	// 	1. GTIN = КМ?
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК КМ,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ Справочно
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ШтрихкодыУпаковокТоваров.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|			И ШтрихкодыУпаковокТоваров.Характеристика = ШтрихкодыНоменклатуры.Характеристика
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &КМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Справочно.Штрихкод = &GTIN
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Результат
		|ИЗ
		|	Справочно КАК Справочно";
	
	Запрос.УстановитьПараметр("GTIN", ОтсканироватьGTIN);
	Запрос.УстановитьПараметр("КМ", ОтсканироватьКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Если РезультатЗапроса.Пустой() ИЛИ НЕ Выборка.Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсканированные GTIN и КМ не соответствуют друг другу."); 
		Возврат Ложь;
	КонецЕсли;
	
	ПодтверждаемыйКМ = ОпределитьКМПоЗначению();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаВозвратТоваровОтКлиентаВозвращаемыеТовары.гф_ПеремаркировкаТовара КАК ПеремаркировкаТовара
		|ПОМЕСТИТЬ Документ
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ВозвращаемыеТовары КАК ЗаявкаНаВозвратТоваровОтКлиентаВозвращаемыеТовары
		|ГДЕ
		|	ЗаявкаНаВозвратТоваровОтКлиентаВозвращаемыеТовары.Ссылка = &Заявка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремаркировкаТоваровИСМПТовары.НовыйКодМаркировки КАК КМ
		|ИЗ
		|	Документ.ПеремаркировкаТоваровИСМП.Товары КАК ПеремаркировкаТоваровИСМПТовары
		|ГДЕ
		|	ПеремаркировкаТоваровИСМПТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				Документ.ПеремаркировкаТовара
		|			ИЗ
		|				Документ КАК Документ)
		|	И ПеремаркировкаТоваровИСМПТовары.НовыйКодМаркировки = &КМ";
	
		
	Если ТипЗнч(ДокументОснованиеПеремаркировки) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		Запрос.УстановитьПараметр("Заявка", ДокументОснованиеПеремаркировки);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗаявкаНаВозвратТоваровОтКлиентаВозвращаемыеТовары.Ссылка = &Заявка",
		"ЗаявкаНаВозвратТоваровОтКлиентаВозвращаемыеТовары.гф_ПеремаркировкаТовара = &Перемаркировка");
		Запрос.УстановитьПараметр("Перемаркировка", ДокументОснованиеПеремаркировки);
	КонецЕсли;
	Запрос.УстановитьПараметр("КМ", ПодтверждаемыйКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсканированный КМ не найден в выбранном документе основания."); 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	гф_КМДляПеремаркировки.Распечатан КАК Распечатан,
		|	гф_КМДляПеремаркировки.Подтвержден КАК Подтвержден
		|ИЗ
		|	РегистрСведений.гф_КМДляПеремаркировки КАК гф_КМДляПеремаркировки
		|ГДЕ
		|	гф_КМДляПеремаркировки.ПеремаркированныйКМ = &КМ";
	
	Запрос.УстановитьПараметр("КМ", ПодтверждаемыйКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка.Следующий();
		Если Выборка.Подтвержден Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсканированный КМ был подтвержден ранее."); 
			Возврат Ложь;
		КонецЕсли;
		Если НЕ Выборка.Распечатан Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отсканированный КМ не был распечатан ранее."); 
			Возврат Ложь;
		КонецЕсли;
		
		ПроизвестиПодтверждениеУказанногоКМ(); 
		Возврат Истина;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По отсканированному КМ нет записей в РС ""КМ для Перемаркировки""."); 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Запись в РС гф_КМДляПеремаркировки для ПодтверждаемыйКМ флага Подтвержден
// Галфинд_Домнышева 2023/07/17
&НаСервере
Процедура ПроизвестиПодтверждениеУказанногоКМ()
	
	ТекДата = ТекущаяДатаСеанса();
	
	НаборЗаписей = РегистрыСведений.гф_КМДляПеремаркировки.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ПеремаркированныйКМ.Установить(ПодтверждаемыйКМ); 
	НаборЗаписей.Прочитать();
	
	ТекущиеЗначения = НаборЗаписей.Выгрузить(); 
	Для каждого Запись Из ТекущиеЗначения Цикл
		Запись.Подтвержден = Истина; 
		Запись.ВремяПодтверждения = ТекДата;				
	КонецЦикла;
	НаборЗаписей.Загрузить(ТекущиеЗначения);
	
	Попытка	
		НаборЗаписей.Записать();    		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось внести сведения по подтверждению КМ в РС ""КМ для Перемаркировки""."); 
		Возврат;
	КонецПопытки;
	 
	ПодтвержденныеКМ.Добавить(ПодтверждаемыйКМ);
	
КонецПроцедуры// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Определяет ссылку на элемент СправочникСсылка.ШтрихкодыУпаковокТоваров для ОтсканироватьКМ 
// Галфинд_Домнышева 2023/07/17
//
// Возвращаемое значение:
//	СправочникСсылка.ШтрихкодыУпаковокТоваров
&НаСервере
Функция ОпределитьКМПоЗначению() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &КМ";
	
	Запрос.УстановитьПараметр("КМ", ОтсканироватьКМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// Команда Завершить передает на форму владельца название команды и ПодтвержденныеКМ. 
// Галфинд_Домнышева 2023/07/17
&НаКлиенте
Процедура Завершить(Команда)
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("ПодтвержденныеКМ", ПодтвержденныеКМ);
	СтруктураЗакрытия.Вставить("Команда", Команда.Имя);
	
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры// } #wortmann

// #wortmann {
// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee1c9530c1660c
// При ручном закрытии передает на форму владельца ПодтвержденныеКМ. 
// Галфинд_Домнышева 2023/07/17
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// #wortmann {
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee40ea0c7c088b
	// Завершает работу с формой при принудительном закрытии 
	// Галфинд_Домнышева 2023/08/23
	Если ОтсканироватьGTIN = "" ИЛИ ОтсканироватьКМ = "" Тогда
		ЗавершениеРаботы = Истина;
	Иначе
	// } #wortmann	
		СтруктураЗакрытия = Новый Структура;
		СтруктураЗакрытия.Вставить("ПодтвержденныеКМ", ПодтвержденныеКМ);
		
		Закрыть(СтруктураЗакрытия); 
	КонецЕсли;
    
КонецПроцедуры// } #wortmann
